test-data/x86_64_callconv:	file format elf64-x86-64

.debug_abbrev contents:
Abbrev table for offset: 0x00000000
[1] DW_TAG_compile_unit	DW_CHILDREN_yes
	DW_AT_producer	DW_FORM_strx1
	DW_AT_language	DW_FORM_data2
	DW_AT_name	DW_FORM_strx1
	DW_AT_str_offsets_base	DW_FORM_sec_offset
	DW_AT_stmt_list	DW_FORM_sec_offset
	DW_AT_comp_dir	DW_FORM_strx1
	DW_AT_low_pc	DW_FORM_addrx
	DW_AT_high_pc	DW_FORM_data4
	DW_AT_addr_base	DW_FORM_sec_offset
	DW_AT_loclists_base	DW_FORM_sec_offset

[2] DW_TAG_base_type	DW_CHILDREN_no
	DW_AT_name	DW_FORM_strx1
	DW_AT_encoding	DW_FORM_data1
	DW_AT_byte_size	DW_FORM_data1

[3] DW_TAG_subprogram	DW_CHILDREN_no
	DW_AT_low_pc	DW_FORM_addrx
	DW_AT_high_pc	DW_FORM_data4
	DW_AT_frame_base	DW_FORM_exprloc
	DW_AT_call_all_calls	DW_FORM_flag_present
	DW_AT_name	DW_FORM_strx1
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data1
	DW_AT_type	DW_FORM_ref4
	DW_AT_external	DW_FORM_flag_present

[4] DW_TAG_subprogram	DW_CHILDREN_yes
	DW_AT_low_pc	DW_FORM_addrx
	DW_AT_high_pc	DW_FORM_data4
	DW_AT_frame_base	DW_FORM_exprloc
	DW_AT_call_all_calls	DW_FORM_flag_present
	DW_AT_name	DW_FORM_strx1
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data1
	DW_AT_prototyped	DW_FORM_flag_present
	DW_AT_type	DW_FORM_ref4
	DW_AT_external	DW_FORM_flag_present

[5] DW_TAG_formal_parameter	DW_CHILDREN_no
	DW_AT_location	DW_FORM_exprloc
	DW_AT_name	DW_FORM_strx1
	DW_AT_decl_file	DW_FORM_data1
	DW_AT_decl_line	DW_FORM_data1
	DW_AT_type	DW_FORM_ref4


                  DW_AT_type [DW_FORM_ref4]	(cu + 0x22b0 => {0x000022b0} "big")

0x000021f2:     NULL

0x000021f3:   DW_TAG_subprogram [8] * (0x0000000c)
                DW_AT_low_pc [DW_FORM_addrx]	(indexed (0000009a) address = 0x000000000040142d)
                DW_AT_high_pc [DW_FORM_data4]	(0x00000005)
                DW_AT_frame_base [DW_FORM_exprloc]	(DW_OP_reg7 RSP)
                DW_AT_call_all_calls [DW_FORM_flag_present]	(true)
                DW_AT_name [DW_FORM_strx1]	(indexed (000000b2) string = "func153")
                DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                DW_AT_decl_line [DW_FORM_data2]	(490)
                DW_AT_prototyped [DW_FORM_flag_present]	(true)
                DW_AT_type [DW_FORM_ref4]	(cu + 0x2284 => {0x00002284} "uint8_t")
                DW_AT_external [DW_FORM_flag_present]	(true)

0x00002204:     DW_TAG_formal_parameter [11]   (0x000021f3)
                  DW_AT_name [DW_FORM_strx1]	(indexed (000000b3) string = "arg0")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data2]	(490)
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225a => {0x0000225a} "void *")

0x0000220d:     DW_TAG_formal_parameter [11]   (0x000021f3)
                  DW_AT_name [DW_FORM_strx1]	(indexed (000000b4) string = "arg1")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data2]	(490)
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225a => {0x0000225a} "void *")

0x00002216:     DW_TAG_formal_parameter [11]   (0x000021f3)
                  DW_AT_name [DW_FORM_strx1]	(indexed (000000b5) string = "arg2")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data2]	(490)
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225a => {0x0000225a} "void *")

0x0000221f:     DW_TAG_formal_parameter [11]   (0x000021f3)
                  DW_AT_name [DW_FORM_strx1]	(indexed (000000b6) string = "arg3")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data2]	(490)
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225a => {0x0000225a} "void *")

0x00002228:     DW_TAG_formal_parameter [11]   (0x000021f3)
                  DW_AT_name [DW_FORM_strx1]	(indexed (000000b7) string = "arg4")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data2]	(490)
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225a => {0x0000225a} "void *")

0x00002231:     DW_TAG_formal_parameter [9]   (0x000021f3)
                  DW_AT_location [DW_FORM_exprloc]	(DW_OP_fbreg +8)
                  DW_AT_name [DW_FORM_strx1]	(indexed (000000b8) string = "arg5")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data2]	(490)
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x2263 => {0x00002263} "small")

0x0000223d:     DW_TAG_formal_parameter [9]   (0x000021f3)
                  DW_AT_location [DW_FORM_exprloc]	(DW_OP_fbreg +24)
                  DW_AT_name [DW_FORM_strx1]	(indexed (000000b9) string = "arg6")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data2]	(490)
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x22b0 => {0x000022b0} "big")

0x00002249:     NULL

0x0000224a:   DW_TAG_base_type [2]   (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (00000007) string = "int")
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_signed)
                DW_AT_byte_size [DW_FORM_data1]	(0x04)

0x0000224e:   DW_TAG_base_type [2]   (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (00000009) string = "char")
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_signed_char)
                DW_AT_byte_size [DW_FORM_data1]	(0x01)

0x00002252:   DW_TAG_base_type [2]   (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (0000000b) string = "short")
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_signed)
                DW_AT_byte_size [DW_FORM_data1]	(0x02)

0x00002256:   DW_TAG_base_type [2]   (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (0000000e) string = "long long")
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_signed)
                DW_AT_byte_size [DW_FORM_data1]	(0x08)

0x0000225a:   DW_TAG_pointer_type [12]   (0x0000000c)

0x0000225b:   DW_TAG_base_type [2]   (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (00000011) string = "float")
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_float)
                DW_AT_byte_size [DW_FORM_data1]	(0x04)

0x0000225f:   DW_TAG_base_type [2]   (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (00000013) string = "double")
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_float)
                DW_AT_byte_size [DW_FORM_data1]	(0x08)

0x00002263:   DW_TAG_structure_type [13] * (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (0000001b) string = "small")
                DW_AT_byte_size [DW_FORM_data1]	(0x10)
                DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                DW_AT_decl_line [DW_FORM_data1]	(36)

0x00002268:     DW_TAG_member [14]   (0x00002263)
                  DW_AT_name [DW_FORM_strx1]	(indexed (00000015) string = "member0")
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225a => {0x0000225a} "void *")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data1]	(37)
                  DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x00002271:     DW_TAG_member [14]   (0x00002263)
                  DW_AT_name [DW_FORM_strx1]	(indexed (00000016) string = "member1")
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225b => {0x0000225b} "float")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data1]	(38)
                  DW_AT_data_member_location [DW_FORM_data1]	(0x08)

0x0000227a:     DW_TAG_member [14]   (0x00002263)
                  DW_AT_name [DW_FORM_strx1]	(indexed (00000017) string = "member2")
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x2284 => {0x00002284} "uint8_t")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data1]	(39)
                  DW_AT_data_member_location [DW_FORM_data1]	(0x0c)

0x00002283:     NULL

0x00002284:   DW_TAG_typedef [15]   (0x0000000c)
                DW_AT_type [DW_FORM_ref4]	(cu + 0x228c => {0x0000228c} "__uint8_t")
                DW_AT_name [DW_FORM_strx1]	(indexed (0000001a) string = "uint8_t")
                DW_AT_decl_file [DW_FORM_data1]	("/usr/include/bits/stdint-uintn.h")
                DW_AT_decl_line [DW_FORM_data1]	(24)

0x0000228c:   DW_TAG_typedef [15]   (0x0000000c)
                DW_AT_type [DW_FORM_ref4]	(cu + 0x2294 => {0x00002294} "unsigned char")
                DW_AT_name [DW_FORM_strx1]	(indexed (00000019) string = "__uint8_t")
                DW_AT_decl_file [DW_FORM_data1]	("/usr/include/bits/types.h")
                DW_AT_decl_line [DW_FORM_data1]	(38)

0x00002294:   DW_TAG_base_type [2]   (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (00000018) string = "unsigned char")
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_unsigned_char)
                DW_AT_byte_size [DW_FORM_data1]	(0x01)

0x00002298:   DW_TAG_structure_type [13] * (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (00000020) string = "small_xmms")
                DW_AT_byte_size [DW_FORM_data1]	(0x10)
                DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                DW_AT_decl_line [DW_FORM_data1]	(53)

0x0000229d:     DW_TAG_member [14]   (0x00002298)
                  DW_AT_name [DW_FORM_strx1]	(indexed (00000015) string = "member0")
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225b => {0x0000225b} "float")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data1]	(54)
                  DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x000022a6:     DW_TAG_member [14]   (0x00002298)
                  DW_AT_name [DW_FORM_strx1]	(indexed (00000016) string = "member1")
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225f => {0x0000225f} "double")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data1]	(55)
                  DW_AT_data_member_location [DW_FORM_data1]	(0x08)

0x000022af:     NULL

0x000022b0:   DW_TAG_structure_type [13] * (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (00000027) string = "big")
                DW_AT_byte_size [DW_FORM_data1]	(0x20)
                DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                DW_AT_decl_line [DW_FORM_data1]	(66)

0x000022b5:     DW_TAG_member [14]   (0x000022b0)
                  DW_AT_name [DW_FORM_strx1]	(indexed (00000015) string = "member0")
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225b => {0x0000225b} "float")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data1]	(67)
                  DW_AT_data_member_location [DW_FORM_data1]	(0x00)

0x000022be:     DW_TAG_member [14]   (0x000022b0)
                  DW_AT_name [DW_FORM_strx1]	(indexed (00000016) string = "member1")
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225f => {0x0000225f} "double")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data1]	(68)
                  DW_AT_data_member_location [DW_FORM_data1]	(0x08)

0x000022c7:     DW_TAG_member [14]   (0x000022b0)
                  DW_AT_name [DW_FORM_strx1]	(indexed (00000017) string = "member2")
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x225a => {0x0000225a} "void *")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data1]	(69)
                  DW_AT_data_member_location [DW_FORM_data1]	(0x10)

0x000022d0:     DW_TAG_member [14]   (0x000022b0)
                  DW_AT_name [DW_FORM_strx1]	(indexed (00000024) string = "member3")
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x2284 => {0x00002284} "uint8_t")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data1]	(70)
                  DW_AT_data_member_location [DW_FORM_data1]	(0x18)

0x000022d9:     DW_TAG_member [14]   (0x000022b0)
                  DW_AT_name [DW_FORM_strx1]	(indexed (00000025) string = "member4")
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x22e3 => {0x000022e3} "uint8_t[3]")
                  DW_AT_decl_file [DW_FORM_data1]	("/home/sebastiano/Code/decompiler/scripts/test.c")
                  DW_AT_decl_line [DW_FORM_data1]	(71)
                  DW_AT_data_member_location [DW_FORM_data1]	(0x19)

0x000022e2:     NULL

0x000022e3:   DW_TAG_array_type [16] * (0x0000000c)
                DW_AT_type [DW_FORM_ref4]	(cu + 0x2284 => {0x00002284} "uint8_t")

0x000022e8:     DW_TAG_subrange_type [17]   (0x000022e3)
                  DW_AT_type [DW_FORM_ref4]	(cu + 0x22ef => {0x000022ef} "__ARRAY_SIZE_TYPE__")
                  DW_AT_count [DW_FORM_data1]	(0x03)

0x000022ee:     NULL

0x000022ef:   DW_TAG_base_type [18]   (0x0000000c)
                DW_AT_name [DW_FORM_strx1]	(indexed (00000026) string = "__ARRAY_SIZE_TYPE__")
                DW_AT_byte_size [DW_FORM_data1]	(0x08)
                DW_AT_encoding [DW_FORM_data1]	(DW_ATE_unsigned)

0x000022f3:   NULL

.debug_loclists contents:
0x00000000: locations list header: length = 0x00000871, format = DWARF32, version = 0x0005, addr_size = 0x08, seg_size = 0x00, offset_entry_count = 0x00000060
offsets: [
0x00000180 => 0x0000018c
0x0000018b => 0x00000197
0x00000196 => 0x000001a2
0x000001ce => 0x000001da
0x00000210 => 0x0000021c
0x0000021d => 0x00000229
0x0000022a => 0x00000236
0x00000240 => 0x0000024c
0x0000024b => 0x00000257
0x00000256 => 0x00000262
0x00000261 => 0x0000026d
0x0000026c => 0x00000278
0x00000278 => 0x00000284
0x00000285 => 0x00000291
0x00000292 => 0x0000029e
0x0000029f => 0x000002ab
0x000002b8 => 0x000002c4
0x000002c5 => 0x000002d1
0x000002d2 => 0x000002de
0x000002df => 0x000002eb
0x0000031b => 0x00000327
0x00000328 => 0x00000334
0x0000036e => 0x0000037a
0x0000037b => 0x00000387
0x0000038a => 0x00000396
0x00000397 => 0x000003a3
0x000003a6 => 0x000003b2
0x000003b3 => 0x000003bf
0x000003cd => 0x000003d9
0x000003da => 0x000003e6
0x000003e7 => 0x000003f3
0x000003f4 => 0x00000400
0x00000401 => 0x0000040d
0x0000040e => 0x0000041a
0x0000041b => 0x00000427
0x00000428 => 0x00000434
0x0000043e => 0x0000044a
0x0000044b => 0x00000457
0x00000458 => 0x00000464
0x00000465 => 0x00000471
0x00000472 => 0x0000047e
0x000004ae => 0x000004ba
0x000004bb => 0x000004c7
0x00000501 => 0x0000050d
0x0000050e => 0x0000051a
0x0000051d => 0x00000529
0x0000052a => 0x00000536
0x00000539 => 0x00000545
0x00000546 => 0x00000552
0x00000560 => 0x0000056c
0x0000056d => 0x00000579
0x0000057a => 0x00000586
0x00000587 => 0x00000593
0x00000594 => 0x000005a0
0x000005a1 => 0x000005ad
0x000005ae => 0x000005ba
0x000005bb => 0x000005c7
0x000005d3 => 0x000005df
0x000005e0 => 0x000005ec
0x000005ed => 0x000005f9
0x000005fa => 0x00000606
0x00000607 => 0x00000613
0x00000643 => 0x0000064f
0x00000650 => 0x0000065c
0x00000696 => 0x000006a2
0x000006a3 => 0x000006af
0x000006b2 => 0x000006be
0x000006bf => 0x000006cb
0x000006ce => 0x000006da
0x000006db => 0x000006e7
0x000006f5 => 0x00000701
0x00000702 => 0x0000070e
0x0000070f => 0x0000071b
0x0000071c => 0x00000728
0x00000729 => 0x00000735
0x00000736 => 0x00000742
0x00000743 => 0x0000074f
0x00000750 => 0x0000075c
0x0000075d => 0x00000769
0x0000076c => 0x00000778
0x00000779 => 0x00000785
0x00000788 => 0x00000794
0x00000795 => 0x000007a1
0x000007af => 0x000007bb
0x000007bc => 0x000007c8
0x000007c9 => 0x000007d5
0x000007d6 => 0x000007e2
0x000007e3 => 0x000007ef
0x000007f0 => 0x000007fc
0x000007fd => 0x00000809
0x0000080a => 0x00000816
0x00000817 => 0x00000823
0x00000826 => 0x00000832
0x00000833 => 0x0000083f
0x00000842 => 0x0000084e
0x0000084f => 0x0000085b
]
0x0000018c: 
            DW_LLE_offset_pair     (0x0000000000000016, 0x000000000000001d): DW_OP_reg5 RDI, DW_OP_piece 0x8, DW_OP_reg4 RSI, DW_OP_piece 0x8
            DW_LLE_end_of_list     ()

0x00000197: 
            DW_LLE_offset_pair     (0x000000000000001d, 0x0000000000000021): DW_OP_reg5 RDI, DW_OP_piece 0x8, DW_OP_reg4 RSI, DW_OP_piece 0x8
            DW_LLE_end_of_list     ()

0x000001a2: 
            DW_LLE_offset_pair     (0x0000000000000021, 0x0000000000000025): DW_OP_reg5 RDI, DW_OP_piece 0x8, DW_OP_piece 0x4, DW_OP_breg4 RSI+0, DW_OP_constu 0x20, DW_OP_shr, DW_OP_convert 0x27, DW_OP_convert 0x2b, DW_OP_stack_value, DW_OP_piece 0x4
